[
  {
    "name": "Lucy Hilton-Jones",
    "picture": "/images/profile-pictures/lucy.jpeg",
    "bio": "Lucy is an award-winning actor, writer and filmmaker. As well as being a member of Greenfingers Films, she is also an Associate Artist with From the Mill Theatre, with whom she has created three Arts Council Funded shows. Nominated for a Funny Women Award for her debut short 'Funemployed', Lucy was encouraged to pursue a career in film. Since then, her own short films have been screened nationally and internationally and have won several awards, including Best Comedy and Micro-Budget at Kino Short Film's 'The People's Film Festival' in 2021. Lucy loves working on projects that mix realism and the absurd with levity and playfulness."
  },
  {
    "name": "Elliot Taylor",
    "picture": "/images/profile-pictures/elliot.jpg",
    "bio": "Elliot is a Manchester-based writer, director and editor. The short films he has directed have been screened at an array of film festivals including Oxford Short Film Festival, HOME’s Filmed up, IndieFlix, Brighton Rocks Film Festival and The People’s Film Festival. He has also edited commercials and content for brands such as Ryobi, Brother, Warwick Castle and Courteeners."
  },
  {
    "name": "Dann Cooper",
    "picture": "/images/profile-pictures/dann.jpg",
    "bio": "Dann is a UK based Director of Photography, he has been working in the UK Film Industry for the past 10 years. With a background in art and a passion for art-house films, he approaches projects with a unique sensibility that ensures the most engaging visuals, whether that be serving the story for narrative projects or solely stylistic for music videos."
  },
  {
    "name": "Liam Francis",
    "picture": "/images/profile-pictures/liam.jpg",
    "bio": "Liam is a writer/director at Greenfingers Films. Over 10 years Liam has had his short films shown in festivals both domestically and internationally. His western drama 'The Devil's Hold' was selected for the Lisbon & Sintra Film Festival and more recently the comedy 'Total Eclipse of the Heart' won the annual Best Comedy Short at the Berlin Indie Film Festival."
  }
]
